In [40]:
import pandas as pd
import numpy as np

In [41]:
people = {"first":["Ali","Ahmed","mohamed",np.nan,None,"NA"],"last":["hassan","omar","omar",np.nan,np.nan,"missing"],"email":["ali@gmial.com","ahmed@gmail.com","mohamed@gmail.com",None,np.nan,np.nan],"age":["33","32","34",np.nan,np.nan,np.nan]}

In [42]:
df = pd.DataFrame(people)
df.replace("NA",np.nan,inplace = True)
df.replace("missing",np.nan,inplace = True)
df

     first    last              email  age
0      Ali  hassan      ali@gmial.com   33
1    Ahmed    omar    ahmed@gmail.com   32
2  mohamed    omar  mohamed@gmail.com   34
3      NaN     NaN               None  NaN
4     None     NaN                NaN  NaN
5      NaN     NaN                NaN  NaN

In [43]:
#dropna

In [44]:
df.dropna()

     first    last              email age
0      Ali  hassan      ali@gmial.com  33
1    Ahmed    omar    ahmed@gmail.com  32
2  mohamed    omar  mohamed@gmail.com  34

In [45]:
df.dropna(axis = "index",how ="any",subset= ["email"])

     first    last              email age
0      Ali  hassan      ali@gmial.com  33
1    Ahmed    omar    ahmed@gmail.com  32
2  mohamed    omar  mohamed@gmail.com  34

In [46]:
df.dropna(axis = "index",how ="all",subset= ["email","last"]) # all like or if one valid it keeps it.. any like and

     first    last              email age
0      Ali  hassan      ali@gmial.com  33
1    Ahmed    omar    ahmed@gmail.com  32
2  mohamed    omar  mohamed@gmail.com  34

In [49]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True   True   True   True
5   True   True   True   True

In [50]:
#fillna

In [54]:
df.fillna("Missing")

     first     last              email      age
0      Ali   hassan      ali@gmial.com       33
1    Ahmed     omar    ahmed@gmail.com       32
2  mohamed     omar  mohamed@gmail.com       34
3  Missing  Missing            Missing  Missing
4  Missing  Missing            Missing  Missing
5  Missing  Missing            Missing  Missing

In [55]:
#astype for casting

In [61]:
df["age"] = df["age"].astype(float)
df["age"].mean()

33.0

In [62]:
#unique

In [67]:
df["age"].unique()

array([33., 32., 34., nan])